basithab/TicTacToe-Pic18f45k22-Lpc1768/TicTacToe-PIC18f45k22-Code.c
// Libraries--------------------------------------------------------------------------
#include "pragmas.h"	
#include <stdlib.h>     
#include <stdio.h>	
#include <p18f45k22.h>
#include <usart.h>      

// Constants ---------------------------------------------------------------------------------
#define TRUE 		1	
#define	FALSE 		0

#define TMR0FLAG INTCONbits.TMR0IF
#define TMR01SEC 0x0BDC
#define ADRSSIZE 4

#define ROW 3
#define COL 3



#define LEDSOFFE TRISE
#define LEDSOFFD TRISD
#define LEDSOFFA TRISA
#define LEDSOFFC TRISC

#define LED21RED LATDbits.LATD0=0 			
#define LED21YELLOW LATDbits.LATD0=1		
#define LED21ON TRISDbits.TRISD0=0

#define LED22RED LATCbits.LATC3=0 			
#define LED22YELLOW LATCbits.LATC3=1		
#define LED22ON TRISCbits.TRISC3=0

#define LED20RED LATDbits.LATD1=0 			
#define LED20YELLOW LATDbits.LATD1=1		
#define LED20ON TRISDbits.TRISD1=0

#define LED12RED LATAbits.LATA7=0 			
#define LED12YELLOW LATAbits.LATA7=1		
#define LED12ON TRISAbits.TRISA7=0

#define LED11RED LATAbits.LATA6=0 			
#define LED11YELLOW LATAbits.LATA6=1		
#define LED11ON TRISAbits.TRISA6=0

#define LED10RED LATCbits.LATC0=0 			
#define LED10YELLOW LATCbits.LATC0=1		
#define LED10ON TRISCbits.TRISC0=0

#define LED02RED LATAbits.LATA5=0 			
#define LED02YELLOW LATAbits.LATA5=1		
#define LED02ON TRISAbits.TRISA5=0

#define LED01RED LATEbits.LATE0=0 			
#define LED01YELLOW LATEbits.LATE0=1		
#define LED01ON TRISEbits.TRISE0=0

#define LED00RED LATEbits.LATE1=0 			
#define LED00YELLOW LATEbits.LATE1=1		
#define LED00ON TRISEbits.TRISE1=0

#define PRESSED 0

#define PLAYER1		1
#define PLAYER2		2	

#define SECONDS		tttAB.time[0][1]
#define MINUTES		tttAB.time[0][0]

#define CONTROLLER 	1
#define SENDER		0

#define BUFFERSIZE 	30
#define TOKENSIZE	10

#define TURNTIME 6

#define RC2FLAG PIR3bits.RC2IF

// Global Variables ----------------------------------------------------------------
unsigned char counter=0;
char enterValue=0;
char rValue=0,cValue=0;
char rFlag=FALSE,cFlag = FALSE;
char manualResetTimer = 0;
char gameFlag = FALSE;
char resetFlag =FALSE;

char availableBlankFlag = FALSE;
char buffCount =0;
char buffFlag= FALSE;
char turnTime= TURNTIME;
char turnTimeFlag= FALSE;
char row=0,col=0;
char played = FALSE;

char *tokens[TOKENSIZE];
char rxBuff[BUFFERSIZE];
char txBuff[BUFFERSIZE];
char dataCollected=FALSE;



//Game Elements-----------------------------------------------------------------------
typedef struct gameBoard
{
	char ticTacToe[ROW][COL];
	char player;
  	char turnCounter;
	char winFlag;

}gameBoard_t;


typedef struct ticTacToe
{
	char address[ADRSSIZE];
	unsigned char select;
	unsigned char time[1][2];		
	char status;
	gameBoard_t game;
}ticTacToe_t;

ticTacToe_t tttAB;


/*--- set_osc__4MHz ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		Setting the oscillator to operate at 4MHz
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void set_osc__4MHz(void)
{
	OSCCON =  0x53; 			// Sleep on sleepp cmd,  4MHz
             
	OSCCON2 = 0x04;			


	OSCTUNE = 0x80;				
						 
	while (OSCCONbits.HFIOFS != 1); 	// wait for osccillator to become stable
}
//eo: set_osc__4MHz

		// --- port configuration ---
/*--- configPort ---------------------------------------------------------------------------
Author:		ABDUL BAASIT
Date:		19/01/2020
Desc:		Set port cofigurations.
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/

void configPort(void)
{
	
	ANSELA 				= 0X00;
	LATA   				= 0X00;
	TRISA              	= 0XE0;

	ANSELC 				= 0X00;  
	LATC 				= 0X00; 
	TRISC				= 0x09;

	ANSELD 				= 0x00;
	LATD				= 0x00;
	TRISD				= 0x03;

	ANSELE				= 0x00;
	LATE				= 0x00;
	TRISE				= 0x03;

	


}		//eo:configPort

// --- 	 ---
/*--- configSerial ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		Configuring pic for serial port-1 configuration
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void configSerial(void)
{
	SPBRG 		= 25;      //  Set baud rate value at 4Mhz
	RCSTA1 		= 0X90;   //  Receiver Status Register
	TXSTA1 		= 0X26;   //   Transmitter Status Register
	BAUDCON1 	= 0X40;  //  Baud rate generator
}		//eo:configSerial

// --- 	 ---
/*---configSerial2 ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		Configuring pic for serial port-2 configuration
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void configSerial2(void)
{
	SPBRG2 		= 12;      // Set baud rate value to 19200
	RCSTA2 		= 0X90;   // Set Receiver Status Register
	TXSTA2 		= 0X26;   //  Set Transmitter Status Register
	BAUDCON2 	= 0X40;  // Set Baud rate generator
}


/*--- resetTmr0 ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		reset the timer to false start 
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void resetTmr0(void)
{
	TMR0H = 0x0B;
	TMR0L = 0xDC;
	TMR0FLAG = FALSE;
} 		//eo:resetTmr0


/*--- timerConfig ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		setting the timer register for 1 second rollover
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/	
void timerConfig(void)
{
	resetTmr0();
	T0CON = 0x93;//93 for 1-sec, 91-.25sec

