basithab/TicTacToe-Pic18f45k22-Lpc1768/TicTacToe-PIC18f45k22-Code.c
}		//eo:timerConfig


/*--- structureInitialzation ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		intializing the declared declared structure elements to zero
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void structureInitialzation(void)
{
	sprintf(tttAB.address,"AB");

	for(row=0; row<ROW; row++)								
	{
		for(col=0; col<COL; col++)
		{
			tttAB.game.ticTacToe[row][col]='\0';			//set game board elements
		}//eo for
	}//eo for

	tttAB.game.player=PLAYER1;
	tttAB.game.turnCounter=FALSE;
	tttAB.game.winFlag=FALSE;
	tttAB.select=FALSE;
	tttAB.time[0][0]=0,tttAB.time[0][1] = 0;
	tttAB.status=TRUE;
}


/*---winningRow---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		check the condition if any row is crossed by a player
Input: 		takes the array(board) as input
Returns:	true or false

--------------------------------------------------------------------------------------------*/
char winningRow(char ticTacToe[][COL])
{
	int rowElement=0;
	for(rowElement=0; rowElement<COL; rowElement++) 
    { 
        if(ticTacToe[rowElement][0] == ticTacToe[rowElement][1] && ticTacToe[rowElement][1] == ticTacToe[rowElement][2] &&  	
        	ticTacToe[rowElement][0] != '\0')
			{
            	return TRUE;
			}//eo if
    }//eo for
    return FALSE;
	
}

/*--- winningCol ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		check the condition if any col is crossed by a player
Input: 		takes the array(board) as input
Returns:	true or false

--------------------------------------------------------------------------------------------*/
char winningCol(char ticTacToe[][COL])
{
	int colElement=0;
	for(colElement=0; colElement<COL; colElement++) 
    { 
        if(ticTacToe[0][colElement] == ticTacToe[1][colElement] && ticTacToe[1][colElement] == ticTacToe[2][colElement] &&  		
            ticTacToe[0][colElement] != '\0') 
			{	
            	return TRUE;
			}//eo if
    }//eo for
    return FALSE;
	
}//eo winningCol

/*---  ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		clears the buffer which saves the received instruction.
Input: 		address of an array
Returns:	none

--------------------------------------------------------------------------------------------*/
void clearBuffer(char *ptr)
{
	while(*ptr)
	{
		*ptr='\0';
		ptr++;
	}
}

/*---interruptConfig  ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		interrupt configuration setup
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void interruptConfig(void)
{
	INTCON=0xC0;
	PIE3bits.RC2IE=1;

}

void ISR(void);

#pragma code interrupt_vector=0x08


/*--- interrupt_vector ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		directing towards the vector
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void interrupt_vector(void)
{
	_asm
		GOTO ISR
	_endasm
} //eo ISR

#pragma code


/*--- calcCheckSum ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		calculates the checksum 
Input: 		address of the array
Returns:	character value
--------------------------------------------------------------------------------------------*/
char calcCheckSum(char *ptr)
{
	char checkSum = 0;	
	while(*ptr)
	{
		checkSum^= *ptr;
		ptr++;
	}
	return checkSum;
}//eo-calcCheckSum




/*---gameEndSentence---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		upon game completion, packages a game sentence and transmits to mbed.
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void gameEndSentence(void)
{
		if(tttAB.game.winFlag && tttAB.game.player == PLAYER2)
		{	
			buffFlag = TRUE;
			sprintf(txBuff,"$GAMEND,%i,%i,%c,%c,%i,%i\0",CONTROLLER,SENDER,'W','X',MINUTES,SECONDS);
			sprintf(txBuff,"%s,%i^\0",txBuff,calcCheckSum(txBuff));
			puts2USART(txBuff);
			 
		}

		else if(tttAB.game.winFlag && tttAB.game.player == PLAYER1)
		{	
			buffFlag = TRUE;
			sprintf(txBuff,"$GAMEND,%i,%i,%c,%c,%i,%i\0",CONTROLLER,SENDER,'W','O',MINUTES,SECONDS);
			sprintf(txBuff,"%s,%i^\0",txBuff,calcCheckSum(txBuff));
			puts2USART(txBuff);
			 
		}

		else
		{
			buffFlag = TRUE;
			sprintf(txBuff,"$GAMEND,%i,%i,%c,%c,%i,%i\0",CONTROLLER,SENDER,'D','N',MINUTES,SECONDS);
			sprintf(txBuff,"%s,%i^\0",txBuff,calcCheckSum(txBuff));
			puts2USART(txBuff);
			 

		}
}


/*--- availableBlank ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		once the timer runs out automatically finds the next available space and fills the
		space, packages and transmits the sentence to mbed and change player turn.
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void availableBlank()
{	
	
	for(row=0; row<ROW; row++)								
	{
		for(col=0; col<COL; col++)
		{
			if (tttAB.game.ticTacToe[row][col] == '\0' && tttAB.game.player == PLAYER1)
			{
				tttAB.game.ticTacToe[row][col] = 'X';
				buffFlag = TRUE;
				sprintf(txBuff,"$PLYPMT,%i,%i,%i,%i,%i\0",CONTROLLER,SENDER,row,col,tttAB.game.player);
				sprintf(txBuff,"%s,%i^\0",txBuff,calcCheckSum(txBuff));
				puts2USART(txBuff);
				 
				return;
			}
			if (tttAB.game.ticTacToe[row][col] == '\0' && tttAB.game.player == PLAYER2)
			{
				tttAB.game.ticTacToe[row][col] = 'O';
				buffFlag = TRUE;
				sprintf(txBuff,"$PLYPMT,%i,%i,%i,%i,%i\0",CONTROLLER,SENDER,row,col,tttAB.game.player);
				sprintf(txBuff,"%s,%i^\0",txBuff,calcCheckSum(txBuff));
				puts2USART(txBuff);
				 
				return;
			}			

		}//eo for
	}

	
			
