basithab/TicTacToe-Pic18f45k22-Lpc1768/TicTacToe-PIC18f45k22-Code.c
}


/*--- collectSentence ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		collect the sentence received from mbed platform byte by byte and saves it into
		an array
Input: 		address of receving buffer(array)
Returns:	none

--------------------------------------------------------------------------------------------*/
void collectSentence(char *ptr)
{
	char hold=0;
	if(RC2FLAG)
	{
		hold=RCREG2;
		if(hold=='$')
		{
			*ptr=hold; 
			while(hold!='^')
			{
				if(RC2FLAG)
				{
					hold=RCREG2;
					ptr++;
					*ptr=hold;
					if (hold=='^')
					{
						ptr++;
						*ptr = 0x00;
						dataCollected= TRUE;
					}
				}
			}
		}
	}
	
}

/*--- validateSentence ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:	 	finds the checksum in the received message and validates it upon successful
		validation returns true and if invalid returns false.
Input: 		address of the buffer(array)
Returns:	TRUE(1) or FALSE (0)

--------------------------------------------------------------------------------------------*/
char validateSentence(char *ptr)
{
	char csFlag = FALSE;
	char rxcs=0;
	char newcs=0;
	int charCount=strlen(ptr);
	while(csFlag==FALSE)
	{
		if(*(ptr+charCount)=='^')
		{
			*(ptr+charCount)=0x00;
		}

		if(*(ptr+charCount)==',')
		{
			*(ptr+charCount)=0x00;
			rxcs=atoi(ptr+charCount+1);
			csFlag=TRUE;
		}
		charCount--;
	}//eo-while
	newcs=calcCheckSum(ptr);

	if(rxcs==newcs)
	{
		return TRUE;
	}
	else
	{
		return FALSE;
	}
}

/*---parseSentence  ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		parse the required information in buffer and address it to a address buffer
Input: 		address of buffer(array)
Returns:	none

--------------------------------------------------------------------------------------------*/
void parseSentence(char*ptr)
{
	int insert=0;
	while(*ptr)
	{
		if(*ptr=='$'||*ptr==',')
		{
			*ptr=0x00;
			tokens[insert]=ptr+1;
			insert++;
		}
		ptr++;
	}//eo-while
} 

/*---reset  ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		reset the whole game
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void reset(void)
{
	
		LEDSOFFC = 0x09;
		LEDSOFFD = 0x03;
		LEDSOFFE = 0x03;
		LEDSOFFA = 0xE0;
		structureInitialzation();
		counter = 0;
		rValue=0,cValue=0,rFlag=0,cFlag=0,enterValue=0;
		
		printf("\033[2J\033[H");
	
}//eo reset


/*--- manualReset ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		resets the game upon receiving a manual reset instruction
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void manualReset()
{
		
			reset();
			gameFlag = FALSE;
			tttAB.game.winFlag = FALSE;
			resetFlag= TRUE;
			turnTimeFlag= FALSE;
			turnTime= TURNTIME;			
		
			
		
}


/*---executeSentence  ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		execute the received instruction 
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void executeSentence(void)
{
	char plypmt[]=("PLYPMT");
	char gamrst[] =("GAMRST");
	if(SENDER ==atoi(tokens[2]))
	{
		if(CONTROLLER==atoi(tokens[1]))
		{
			if(strcmp(plypmt,tokens[0]) == 0)
			{
				rValue = atoi(tokens[3]);
				cValue = atoi(tokens[4]);
				tttAB.game.player = atoi(tokens[5]);
				gameFlag= TRUE;
				resetFlag = FALSE;
				tttAB.game.winFlag = FALSE;
				turnTimeFlag= TRUE;
				if(tttAB.game.player == PLAYER1 && tttAB.game.ticTacToe[rValue][cValue] != '/0' && tttAB.game.ticTacToe[rValue][cValue] != 'O' )
				{
					tttAB.game.ticTacToe[rValue][cValue] = 'X';
				}

				
				if(tttAB.game.player == PLAYER2 && tttAB.game.ticTacToe[rValue][cValue] != '/0' && tttAB.game.ticTacToe[rValue][cValue] != 'X' )
				{
					tttAB.game.ticTacToe[rValue][cValue]= 'O';
				}
			}

			if( strcmp(gamrst,tokens[0]) == 0)
			{
				if('Y' == *tokens[3])
				{
					manualReset();
				}
					
			}
					
		}
	}	
}
// --- 	 ---
/*---  ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		check for diagnol crossing
Input: 		address of an array(board)
Returns:	true or false

--------------------------------------------------------------------------------------------*/
char diagonalWin(char ticTacToe[][COL])
{
	if(ticTacToe[0][0] == ticTacToe[1][1] && ticTacToe[1][1] == ticTacToe[2][2] &&  					//It will return true if the diagonals are same
        ticTacToe[0][0] != '\0')
		{ 
        	return TRUE;
		}//eo if
          
    if (ticTacToe[0][2] == ticTacToe[1][1] && ticTacToe[1][1] == ticTacToe[2][0] && 
         ticTacToe[0][2] != '\0') 
        {
			return TRUE; 
  		}//eo if
    return FALSE; 
}//diagonalWin	



/*--- turnChange ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		turns the change if player doesn't play and runs out of 30secs.
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void turnChange()
{
	if(turnTimeFlag)
	{ 
		turnTime--;
		if(turnTime == 0 && !played )
		{
			availableBlankFlag= TRUE;
			turnTime = TURNTIME;
			tttAB.game.player++;
			tttAB.game.turnCounter++;
			tttAB.select=0;
			rValue=0,cValue=0,rFlag=FALSE,cFlag=FALSE,enterValue=0;
			if( tttAB.game.player == 3)
			{
				tttAB.game.player =PLAYER1;
			}
		
