basithab/TicTacToe-Pic18f45k22-Lpc1768/TicTacToe-PIC18f45k22-Code.c
		}
		else if(turnTime && played )
		{
			turnTime = TURNTIME;
			played = FALSE;
		}
			
	}
}
			
	
/*--- time ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		game clock
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/

void time(void)
{

	SECONDS++;
	if(SECONDS==60)
	{
			SECONDS =0;
			MINUTES++;			
	}//eo if(SECONDS==60)

}//eo time

/*---gameEnd  ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		check for win condition
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/

char gameEnd(char ticTacToe[][COL])
{
	
	if((winningRow(ticTacToe) || winningCol(ticTacToe) || diagonalWin(ticTacToe)))		//if any row/col/diagonal match, game will be end
	{
		tttAB.game.winFlag = TRUE;
		gameFlag = FALSE;
		resetFlag = FALSE;
		return tttAB.game.winFlag;
	}
	else
	{
	return FALSE;
	}
}//eo gameEnd



/*--- updateDisplay ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		real time GUI
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/
void updateDisplay()
{
	printf("\33[1;0HTicTacToe%s\n\r",tttAB.address);
	printf("\33[2;0HGame Time:%i:%2i",MINUTES,SECONDS);
	if(tttAB.game.winFlag && !gameFlag && !resetFlag)
	{
			printf("\33[2;40HStatus:WON     \n\r");
	}
	else if(gameFlag && !tttAB.game.winFlag && !resetFlag)
	{
			printf("\33[2;40HStatus:Playing\n\r");
	}
	else if(!gameFlag && !tttAB.game.winFlag && !resetFlag)
	{
			printf("\33[2;40HStatus:Ready    \n\r");
	}
	else
	{
			printf("\33[2;40HStatus:Reset      \n\r");
	}

	if(tttAB.game.player == PLAYER1)
	{
		printf("\33[3;0HPlayer:%c\n\r",'X');
	}
	else
	{
		printf("\33[3;0HPlayer:%c\n\r",'O');
	}
		
	printf("\33[3;40HTurn Count:%i\n\r",tttAB.game.turnCounter);
	turnChange();
	printf("Turn Time:%2i\33[4;40H\n\r",turnTime);
	printf("\n\33[5;6HCOLUMN\n\r");
	printf("\33[6;5H0\33[6;9H1\33[6;13H2\n\r");
	printf("\33[7;3H0\33[7;5H%c\33[7;7H|\33[7;9H%c\33[7;11H|\33[7;13H%c\n\r",tttAB.game.ticTacToe[0][0],tttAB.game.ticTacToe[0][1],tttAB.game.ticTacToe[0][2]);
	printf("\33[8;1HR\33[8;4H------------\n\r");
    printf("\33[9;1HO\33[9;3H1\33[9;5H%c\33[9;7H|\33[9;9H%c\33[9;11H|\33[9;13H%c\n\r",tttAB.game.ticTacToe[1][0],tttAB.game.ticTacToe[1][1],tttAB.game.ticTacToe[1][2]);
	printf("\33[10;1HW\33[10;4H------------\n\r");
	printf("\33[11;3H2\33[11;5H%c\33[11;7H|\33[11;9H%c\33[11;11H|\33[11;13H%c\n\r",tttAB.game.ticTacToe[2][0],tttAB.game.ticTacToe[2][1],tttAB.game.ticTacToe[2][2]);

	if(buffFlag == TRUE)//commsenetence display for 5seconds
	{
		buffCount++;
		if(buffCount<5  )
		{
				printf("\33[14;0H%s",txBuff);
			
		}

		if(buffCount<5 && PIE3bits.RC2IE  )
		{
				printf("\33[14;0H%s",rxBuff);
			
		}		
		else //if(buffCount>5)
		{	
			clearBuffer(txBuff);
			clearBuffer(rxBuff);
			printf("\33[14;0H\33[2K");
			buffFlag =FALSE;
			buffCount =0;
		}	
	}
}//eo updateDisplay

/*--- initializeSystem ---------------------------------------------------------------------------
Author:		Abdul Baasit
Date:		19/01/2020
Desc:		intialize all the fuction required for intial setup
Input: 		none
Returns:	none

--------------------------------------------------------------------------------------------*/

void initializeSystem(void)
{
	set_osc__4MHz();	
	configPort();		
	configSerial();
	configSerial2();         				
	timerConfig();
	structureInitialzation();
	interruptConfig();
	
	
}		//eo:initializeSystem

#pragma interrupt ISR


void ISR(void)
{
	if(RC2FLAG)
	{
		PIE3bits.RC2IE=0;
		collectSentence(rxBuff);
		PIE3bits.RC2IE=1;
	}

}
/*****************MAIN FUNCTION **************************************************************
 *********************************************************************************/
void main()
{

	
	initializeSystem();
	
	
	while(TRUE)
	{
		
		
		
		if(TMR0FLAG)
		{
			resetTmr0();
			if(gameFlag)
			{
				time();
			}		
			updateDisplay();
		}//eo if(TMR0FLAG)
		
		if(gameEnd(tttAB.game.ticTacToe))
		{
			gameEndSentence();
			reset();
			gameFlag=FALSE;
			resetFlag = FALSE;
			tttAB.game.winFlag = TRUE;
			turnTimeFlag= FALSE;
			turnTime= TURNTIME;
			
		}
		else if((tttAB.game.ticTacToe[0][0] != '\0') && (tttAB.game.ticTacToe[0][1] != '\0') &&
			(tttAB.game.ticTacToe[0][2] != '\0') && (tttAB.game.ticTacToe[1][0] != '\0') &&	(tttAB.game.ticTacToe[1][1] != '\0') &&
			 (tttAB.game.ticTacToe[1][2] != '\0') && (tttAB.game.ticTacToe[2][0] != '\0') && (tttAB.game.ticTacToe[2][1] != '\0') && 
				(tttAB.game.ticTacToe[2][2] != '\0') )
		{
			gameEndSentence();
			reset();
			gameFlag=FALSE;
			resetFlag = FALSE;
			tttAB.game.winFlag = FALSE;
			turnTimeFlag= FALSE;
			turnTime= TURNTIME;
			
		}//eo if
	
	if(dataCollected == TRUE)
        {
             
            dataCollected = FALSE;
            
            if(validateSentence(rxBuff))
            {
                
                parseSentence(rxBuff);
                executeSentence();
            }
         }
	if(availableBlankFlag)
	{
		availableBlank();
		availableBlankFlag = FALSE;
	}


	}//eo-while


}//eo main
